[
    {
        "directory": "santurce-event",
        "name": "santurce: sabor y arte",
        "type": "Illustration and Event Design",
        "description": "\"Santurce: Sabor y Arte\" is a fictional event concept inspired by the vibrant culture of Santurce, Puerto Rico. The event is a showcase of Puerto Rican music, food, and art.\n\nFor this project, I designed an event ticket and promotional poster using Adobe Illustrator, incorporating key cultural elements such as the beach, a cuatro (a traditional Puerto Rican stringed instrument), and Santurce’s iconic colorful houses. I brought the design to life by  animating the poster in After Effects, adding movement that enhances the energy and rhythm of the event.",
        "media": [
            {
                "source": "animated-poster.mp4",
                "alt": "Animated event poster.",
                "type": "video"
            },
            {
                "source": "finished-poster.webp",
                "alt": "Static event poster.",
                "type": "image"
            },
            {
                "source": "ticket.webp",
                "alt": "Ticket for admission to the event.",
                "type": "image"
            }
        ]
    },
    {
        "directory": "miau-made",
        "name": "miau made",
        "type": "Branding Design",
        "description": "",
        "media": [
            {
                "source": "logo.webp",
                "alt": "Miau Made logo image",
                "type": "image"
            },
            {
                "source": "palette.webp",
                "alt": "Palette showcase image",
                "type": "image"
            }
        ]
    },
    {
        "directory": "dunkin",
        "name": "dunkin advert",
        "type": "Advertising and Marketing Design",
        "description": "",
        "media": [
            {
                "source": "dunkin.mp4",
                "alt": "Avertisement video",
                "type": "video"
            }
        ]
    },
    {
        "directory": "teony",
        "name": "teony",
        "type": "Branding and Packaging Design",
        "description": "Teaony is a fictional tea brand inspired by the peony flower, known for its delicate sweetness and immune-boosting properties when used in tea.\n\nThis project was a personal passion, where I developed everything from the brand concept and name to the visual identity and packaging. This project stemmed from my love of flowers and tea. I designed a floral logo with a delicate type that reflects the elegant and soothing nature of peonies\n\nI designed two distinct tea blends:\nThe \"Calm Blend,\" infused with peony and chamomile, features a soft purple-blue color to convey relaxation and tranquility.\nThe \"Energy Blend\" is a vibrant yellow, symbolizing warmth and an invigorating burst of energy.",
        "media": [
            {
                "source": "tea-bags.webp",
                "alt": "Tea bag packaging design",
                "type": "image"
            },
            {
                "source": "tea-can.webp",
                "alt": "Tea can packaging design",
                "type": "image"
            },
            {
                "source": "logo.webp",
                "alt": "Tea company logo design",
                "type": "image"
            }
        ]
    },
    {
        "directory": "tender-is-the-flesh",
        "name": "tender is the flesh",
        "type": "Book Cover Design",
        "description": "This project presents a series of alternative cover designs for Tender is the Flesh by Agustina Bazterrica, a novel that explores themes of cannibalism and morality. Each design features a distinct visual interpretation of these unsettling themes, aiming to balance subtlety and emotional impact.\n\nThe primary cover features a delicate font contrasted by a blood-stained plate, subtly hinting at the novel’s horrific themes.\n\nOne variation mimics the appearance of a supermarket meat package ,showcasing how the commodification of human flesh is central to the story.\n\nAnother design depicts a human-shaped meat diagram with bold typography, emphasizing the novel’s gruesome and unsettling subject matter.",
        "media": [
            {
                "source": "final-book.webp",
                "alt": "Final book design.",
                "type": "image"
            },
            {
                "source": "three-books.webp",
                "alt": "Book design options.",
                "type": "image"
            },
            {
                "source": "book-jacket-design.webp",
                "alt": "Final book design spread.",
                "type": "image"
            }
        ]
    }
]